# Manipulate data Examples

In this notebook, you will find example about: 

- [Add a column](#Add-a-column)
- [Rename a column](#Rename-a-column)
- [Getting a subset of columns](#Getting-a-subset-of-columns)
- [Remove a column](#Remove-a-column)

In [1]:
# Copyright (c) 2022 Grumpy Cat Software S.L.
#
# This Source Code is licensed under the MIT 2.0 license.
# the terms can be found in LICENSE.md at the root of
# this project, or at http://mozilla.org/MPL/2.0/.

import shapelets as sh

session = sh.sandbox()

data = session.load_test_data()

# Add a column

In [2]:
data = data.add_column('new_feature', lambda row: row.Sepal_Length*row.Sepal_Width)

In [3]:
data

Column        NumPy Type    SQL Type
new_feature   float64       DOUBLE
Sepal_Length  float64       DOUBLE
Sepal_Width   float64       DOUBLE
Petal_Length  float64       DOUBLE
Petal_Width   float64       DOUBLE
Class         object        VARCHAR

In [4]:
data.head()

,new_feature,Sepal_Length,Sepal_Width,Petal_Length,Petal_Width,Class
0,17.85,5.1,3.5,1.4,0.2,Iris-setosa
1,14.70,4.9,3.0,1.4,0.2,Iris-setosa
2,15.04,4.7,3.2,1.3,0.2,Iris-setosa
3,14.26,4.6,3.1,1.5,0.2,Iris-setosa
4,18.00,5.0,3.6,1.4,0.2,Iris-setosa

# Rename a column

In [5]:
data = data.rename_columns({'new_feature':'Sepal_Area'})

In [6]:
data

Column        NumPy Type    SQL Type
Sepal_Area    float64       DOUBLE
Sepal_Length  float64       DOUBLE
Sepal_Width   float64       DOUBLE
Petal_Length  float64       DOUBLE
Petal_Width   float64       DOUBLE
Class         object        VARCHAR

In [7]:
data.head()

,Sepal_Area,Sepal_Length,Sepal_Width,Petal_Length,Petal_Width,Class
0,17.85,5.1,3.5,1.4,0.2,Iris-setosa
1,14.70,4.9,3.0,1.4,0.2,Iris-setosa
2,15.04,4.7,3.2,1.3,0.2,Iris-setosa
3,14.26,4.6,3.1,1.5,0.2,Iris-setosa
4,18.00,5.0,3.6,1.4,0.2,Iris-setosa

# Getting a subset of columns

In [8]:
data.select_columns(['Sepal_Area','Sepal_Length','Sepal_Width'])

Column        NumPy Type    SQL Type
Sepal_Area    float64       DOUBLE
Sepal_Length  float64       DOUBLE
Sepal_Width   float64       DOUBLE

In [9]:
data.select_columns([0,1,2])

Column        NumPy Type    SQL Type
Sepal_Area    float64       DOUBLE
Sepal_Length  float64       DOUBLE
Sepal_Width   float64       DOUBLE

# Remove a column

In [10]:
data = data.drop_columns(['Class'])

In [11]:
data

Column        NumPy Type    SQL Type
Sepal_Area    float64       DOUBLE
Sepal_Length  float64       DOUBLE
Sepal_Width   float64       DOUBLE
Petal_Length  float64       DOUBLE
Petal_Width   float64       DOUBLE